ГРГ

1- открыть в браузерном окно поиска и перейти по ссылке: httpsgithub.comsignup
; зарегистрироваться или создать аккаунт 
2.Зайти на профиль и нажать (+) в правом верхнем углу
и создать новый репозиторий введя все данные которые вам необходимы

Для клонирования репа в git нужно использовать команду git clone  
В терминале ( в низу слева в общей панели ) вставив ссылку репозитория который вам необходим в cmd (командная строка) ,
Вот тип такого (git clone https://github.com/blablabla/blebleble/yumi.jxs )
